PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_spi.c
/*!
    \file    gd32f3x0_hal_spi.c
    \brief   SPI driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f3x0_hal.h"

#define SPI_INIT_CTL0_MASK                   ((uint32_t)0x00001040U)  /*!< SPI_CTL0 parameter initialization mask */
#define SPI_INIT_CTL1_MASK                   ((uint32_t)0x000000E3U)  /*!< SPI_CTL1 parameter initialization mask */
#define SPI_INIT_QCTL_MASK                   ((uint32_t)0x00000000U)  /*!< SPI_QCTL parameter initialization mask */

#define SPI_TIMEOUT_VALUE  200

/* SPI private function */
static void _spi_deinit(uint32_t periph);

static void _spi_transmit_interrupt(void *spi);
static void _spi_receive_interrupt(void *spi);
static void _spi_2lines_receive_interrupt(void *spi);
static void _spi_2lines_transmit_interrupt(void *spi);

static void _spi_transmit_compelete_dma(void *dma);
static void _spi_receive_compelete_dma(void *dma);
static void _spi_transmit_receive_compelete_dma(void *dma);
static void _spi_dma_error(void *dma);

static void _spi_stop_receive_interrupt(void *spi);
static void _spi_stop_transmit_interrupt(void *hspi);
static void _spi_close_receive_interrupt(hal_spi_dev_struct *spi);
static void _spi_close_transmit_interrupt(hal_spi_dev_struct *spi);
static void _spi_close_transmit_receive_interrupt(hal_spi_dev_struct *spi);

static int32_t _spi_end_transmit_receive(hal_spi_dev_struct *spi, uint32_t timeout_ms);
static int32_t _spi_end_receive(hal_spi_dev_struct *spi, uint32_t timeout_ms);

static void _spi_clear_error_flag(uint32_t periph, uint32_t error_flag);

static FlagStatus _spi_flag_get(uint32_t periph, uint32_t flag);
static FlagStatus _spi_interrupt_flag_get(uint32_t periph, uint8_t interrupt);

/*!
    \brief      deinitialize SPI
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_spi_deinit(hal_spi_dev_struct *spi)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == spi) {
        HAL_DEBUGE("parameter [*spi] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if((SPI0 == spi->periph) || (SPI1 == spi->periph)) {
        spi->state = HAL_SPI_STATE_BUSY;
        /* reset SPI */
        _spi_deinit(spi->periph);
        hal_spi_struct_init(HAL_SPI_DEV_STRUCT, spi);
        spi->state = HAL_SPI_STATE_READY;
    } else {
        HAL_DEBUGE("parameter [spi->periph] value is invalid");
    }
}

/*!
    \brief      initialize the SPI structure
    \param[in]  struct_type: refer to hal_spi_struct_type_enum
    \param[in]  p_struct: point to SPI structure that contains the configuration information
    \param[out] none
    \retval     none
*/
void hal_spi_struct_init(hal_spi_struct_type_enum struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == p_struct) {
        HAL_DEBUGE("parameter [*p_struct] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    switch(struct_type) {
    case HAL_SPI_INIT_STRUCT:
        /* initialize SPI initialization structure with the default values */
        ((hal_spi_init_struct *)p_struct)->device_mode          = SPI_MASTER ;
        ((hal_spi_init_struct *)p_struct)->trans_mode           = SPI_TRANSMODE_FULLDUPLEX;
        ((hal_spi_init_struct *)p_struct)->frame_size           = SPI_FRAMESIZE_8BIT;
        ((hal_spi_init_struct *)p_struct)->nss                  = SPI_NSS_SOFT;
        ((hal_spi_init_struct *)p_struct)->clock_polarity_phase = SPI_CK_PL_LOW_PH_1EDGE;
        ((hal_spi_init_struct *)p_struct)->prescaler            = SPI_PSC_16;
        ((hal_spi_init_struct *)p_struct)->crc_calculation      = SPI_CRC_DISABLE;
        ((hal_spi_init_struct *)p_struct)->crc_poly             = 0x07U;
        ((hal_spi_init_struct *)p_struct)->endian               = SPI_ENDIAN_MSB;
        ((hal_spi_init_struct *)p_struct)->nssp_mode            = SPI_NSSP_DISABLE;
        ((hal_spi_init_struct *)p_struct)->ti_mode              = SPI_TIMODE_DISABLE;
        break;

    case HAL_SPI_DEV_STRUCT:
        /* initialize SPI device information structure with the default values */
        ((hal_spi_dev_struct *)p_struct)->periph                   = 0U;
        ((hal_spi_dev_struct *)p_struct)->spi_irq.error_handler    = NULL;
        ((hal_spi_dev_struct *)p_struct)->spi_irq.receive_handler  = NULL;
        ((hal_spi_dev_struct *)p_struct)->spi_irq.transmit_handler = NULL;
        ((hal_spi_dev_struct *)p_struct)->p_dma_rx                 = NULL;
        ((hal_spi_dev_struct *)p_struct)->p_dma_tx                 = NULL;
        ((hal_spi_dev_struct *)p_struct)->txbuffer.buffer          = NULL;
        ((hal_spi_dev_struct *)p_struct)->txbuffer.length          = 0U;
        ((hal_spi_dev_struct *)p_struct)->txbuffer.pos             = 0U;
        ((hal_spi_dev_struct *)p_struct)->rxbuffer.buffer          = NULL;
        ((hal_spi_dev_struct *)p_struct)->rxbuffer.length          = 0U;
        ((hal_spi_dev_struct *)p_struct)->rxbuffer.pos             = 0U;
        ((hal_spi_dev_struct *)p_struct)->rx_callback              = NULL;
        ((hal_spi_dev_struct *)p_struct)->tx_callback              = NULL;
        ((hal_spi_dev_struct *)p_struct)->tx_rx_callback           = NULL;
        ((hal_spi_dev_struct *)p_struct)->error_callback           = NULL;
        ((hal_spi_dev_struct *)p_struct)->state                    = HAL_SPI_STATE_READY;
        ((hal_spi_dev_struct *)p_struct)->error_code               = HAL_SPI_ERROR_NONE;
        ((hal_spi_dev_struct *)p_struct)->mutex                    = HAL_MUTEX_UNLOCKED;
        break;

    default:
        HAL_DEBUGW("parameter [struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      initialize SPI
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  periph: SPI peripheral address
    \param[in]  p_init: the initialization data needed to initialize SPI
                  device_mode: SPI_MASTER, SPI_SLAVE
                  trans_mode: the argument could be selected from enumeration <hal_hal_spi_trans_mode_enum>
                  frame_size: SPI_FRAMESIZE_16BIT, SPI_FRAMESIZE_8BIT
                  nss: SPI_NSS_SOFT, SPI_NSS_HARD
                  endian: SPI_ENDIAN_MSB, SPI_ENDIAN_LSB
                  clock_polarity_phase: SPI_CK_PL_LOW_PH_1EDGE, SPI_CK_PL_HIGH_PH_1EDGE, SPI_CK_PL_LOW_PH_2EDGE, SPI_CK_PL_HIGH_PH_2EDGE
                  prescaler: the argument could be selected from enumeration <hal_hal_spi_prescaler_enum>
                  crc_calculation: SPI_CRC_DISABLE, SPI_CRC_ENABLE
                  crc_poly: 0x00 ~ 0xFF
                  nssp_mode: SPI_NSSP_ENABLE, SPI_NSSP_DISABLE
                  ti_mode: SPI_TIMODE_DISABLE, SPI_TIMODE_ENABLE
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
int32_t hal_spi_init(hal_spi_dev_struct *spi, uint32_t periph, hal_spi_init_struct *p_init)
{
    uint32_t reg0 = 0U;
    uint32_t reg1 = 0U;
    uint32_t reg3 = 0U;

