PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_spi.c
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == spi) || (NULL == p_init)) {
        return HAL_ERR_ADDRESS;
    }
    if((SPI0 == periph) && ((SPI_TRANSMODE_QUADRECEIVE == p_init->trans_mode) ||
                            (SPI_TRANSMODE_QUADTRANSMIT == p_init->trans_mode))) {
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    spi->periph = periph;

    spi->state = HAL_SPI_STATE_BUSY;
    __HAL_SPI_DISABLE(periph);

    /* SPI init */
    reg0 = SPI_CTL0(periph);
    reg0 &= SPI_INIT_CTL0_MASK;

    if((SPI1 == periph) && ((SPI_TRANSMODE_QUADRECEIVE == p_init->trans_mode) ||
                            (SPI_TRANSMODE_QUADTRANSMIT == p_init->trans_mode))) {
        /* SPI1 quad mode */
        reg3 = SPI_QCTL(periph);
        reg3 &= SPI_INIT_QCTL_MASK;
        reg3 |= p_init->trans_mode;
        /* write to SPI_QCTL register */
        SPI_QCTL(periph) = (uint32_t)reg3;

        p_init->endian = SPI_ENDIAN_MSB;
        p_init->crc_calculation = SPI_CRC_DISABLE;
        p_init->frame_size = SPI_FRAMESIZE_8BIT;
    } else {
        reg0 |= p_init->trans_mode;
    }
    reg0 |= (p_init->frame_size | p_init->device_mode | p_init->crc_calculation | p_init->nss | p_init->endian |
             p_init->clock_polarity_phase | p_init->prescaler);
    /* write to SPI_CTL0 register */
    SPI_CTL0(periph) = (uint32_t)reg0;

    reg1 = SPI_CTL1(periph);
    reg1 &= SPI_INIT_CTL1_MASK;
    reg1 |= p_init->ti_mode | p_init->nssp_mode;
    if((SPI_MASTER ==  p_init->device_mode) && (SPI_NSS_HARD == p_init->nss)) {
        reg1 |= SPI_CTL1_NSSDRV;
    }
    /* write to SPI_CTL1 register */
    SPI_CTL1(periph) = (uint32_t)reg1;
    if(SPI_CRC_ENABLE == p_init->crc_calculation) {
        SPI_CRCPOLY(periph) = (uint32_t)(p_init->crc_poly);
    }

    /* select SPI mode */
    SPI_I2SCTL(periph) &= (uint32_t)(~SPI_I2SCTL_I2SSEL);

    spi->state = HAL_SPI_STATE_READY;
    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data, poll transmit process and completed status, the function is blocking
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_txbuffer: pointer to txbuffer
    \param[in]  length: length of data to be sent
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL, HAL_ERR_BUSY,HAL_ERR_TIMEOUT details refer to gd32f3x0_hal.h
*/
int32_t hal_spi_transmit_poll(hal_spi_dev_struct *spi, uint8_t *p_txbuffer, uint32_t length, uint32_t timeout_ms)
{
    uint32_t tick_start;

#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == spi) || (NULL == p_txbuffer) || (0 == length)) {
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(spi->state != HAL_SPI_STATE_READY) {
        return HAL_ERR_BUSY;
    }

    /* lock SPI */
    HAL_LOCK(spi);

    /* set the transaction information */
    spi->state = HAL_SPI_STATE_BUSY_TX;
    spi->error_code = HAL_ERR_NONE;
    spi->txbuffer.buffer  = (uint8_t *)p_txbuffer;
    spi->txbuffer.length  = length;
    spi->txbuffer.pos     = length;

    /* init field not used to zero */
    spi->rxbuffer.buffer  = (uint8_t *)NULL;
    spi->rxbuffer.length  = 0U;
    spi->rxbuffer.pos     = 0U;
    spi->tx_callback      = NULL;
    spi->rx_callback      = NULL;

    /* 1 line transmit */
    if((SPI_CTL0(spi->periph)) & (SPI_CTL0_BDEN)) {
        SPI_CTL0(spi->periph) |= SPI_CTL0_BDOEN;
    }

    if(__HAL_SPI_GET_CRC_USED(spi->periph) == SPI_CRC_ENABLE) {
        /* reset CRC */
        __HAL_SPI_CRC_OFF(spi->periph);
        __HAL_SPI_CRC_ON(spi->periph);
    }
    __HAL_SPI_ENABLE(spi->periph);

    if(__HAL_SPI_GET_FRAME_SIZE(spi->periph) == SPI_FRAMESIZE_16BIT) {
        if((SPI_SLAVE == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) || (0x01U == spi->txbuffer.pos)) {
            SPI_DATA(spi->periph) = *((uint16_t *)p_txbuffer);
            p_txbuffer += sizeof(uint16_t);
            spi->txbuffer.pos--;
        }

        /* transmit 16 bit data*/
        while(spi->txbuffer.pos > 0U) {
            /* wait TBE set */
            tick_start = hal_sys_basetick_count_get();
            while(RESET == _spi_flag_get(spi->periph, SPI_FLAG_TBE)) {
                if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                    if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                        return HAL_ERR_TIMEOUT;
                    }
                }
            }
            /* transmit data */
            SPI_DATA(spi->periph) = *((uint16_t *)p_txbuffer);
            p_txbuffer += sizeof(uint16_t);
            spi->txbuffer.pos--;
        }

    } else { /* transmit 8 bit data */
        if((SPI_SLAVE == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) ||
                (0x01U == spi->txbuffer.pos)) {
            SPI_DATA(spi->periph) = (*p_txbuffer);
            p_txbuffer += sizeof(uint8_t);
            spi->txbuffer.pos--;
        }
        while(spi->txbuffer.pos > 0U) {
            /* wait until TBE is set */
            tick_start = hal_sys_basetick_count_get();
            while(RESET == _spi_flag_get(spi->periph, SPI_FLAG_TBE)) {
                if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                    if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                        return HAL_ERR_TIMEOUT;
                    }
                }
            }

            *(__IO uint8_t *)&SPI_DATA(spi->periph) = (*p_txbuffer++);
            spi->txbuffer.pos--;
        }
    }

    if(__HAL_SPI_GET_CRC_USED(spi->periph) == SPI_CRC_ENABLE) {
        /* next data is crc */
        __HAL_SPI_CRC_NEXT(spi->periph);
    }

    /* check the end of the transaction */
    if(HAL_ERR_NONE != _spi_end_transmit_receive(spi, SPI_TIMEOUT_VALUE)) {
        return HAL_ERR_TIMEOUT ;
    }
    spi->state = HAL_SPI_STATE_READY;

    /* unlock SPI */
    HAL_UNLOCK(spi);

