PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_spi.c
    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data, poll receive process and completed status, the function is blocking
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_rxbuffer: pointer to rxbuffer
    \param[in]  length: length of data to be sent
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_spi_receive_poll(hal_spi_dev_struct *spi, uint8_t *p_rxbuffer, uint32_t length, uint32_t timeout_ms)
{
    __IO uint16_t tmp_crc = 0U;
    uint32_t tick_start = 0;

#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == spi) || (NULL == p_rxbuffer) || (0 == length)) {
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if((SPI_MASTER == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) &&
            (SPI_TRANSMODE_FULLDUPLEX == __HAL_SPI_GET_TRANS_MODE(spi->periph))) {
        spi->state = HAL_SPI_STATE_READY;
        /* call transmit-receive function to send dummy data generate clock */
        return hal_spi_transmit_receive_poll(spi, p_rxbuffer, p_rxbuffer, length, timeout_ms);
    }

    if(HAL_SPI_STATE_READY != spi->state) {
        return HAL_ERR_BUSY;
    }

    /* lock SPI */
    HAL_LOCK(spi);

    spi->state            = HAL_SPI_STATE_BUSY_RX;
    spi->error_code       = HAL_ERR_NONE;
    /* init field not used to zero */
    spi->txbuffer.buffer  = (uint8_t *)NULL;
    spi->txbuffer.length  = 0U;
    spi->txbuffer.pos     = 0U;
    spi->tx_callback      = NULL;
    spi->rx_callback      = NULL;
    spi->tx_rx_callback   = NULL;
    spi->error_callback   = NULL;
    /* set the receiver information */
    spi->rxbuffer.buffer  = (uint8_t *)p_rxbuffer;
    spi->rxbuffer.length  = length;
    spi->rxbuffer.pos     = length;

    /* 1 line receive */
    if((SPI_CTL0(spi->periph)) & (SPI_CTL0_BDEN)) {
        SPI_CTL0(spi->periph) &= ~SPI_CTL0_BDOEN;
    }

    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)) {
        /* reset CRC */
        __HAL_SPI_CRC_OFF(spi->periph);
        __HAL_SPI_CRC_ON(spi->periph);
        /* set crc next bit before the latest data */
        spi->rxbuffer.pos--;
    }

    __HAL_SPI_ENABLE(spi->periph);

    /* receive 8 bit data */
    if(__HAL_SPI_GET_FRAME_SIZE(spi->periph) == SPI_FRAMESIZE_8BIT) {
        while(spi->rxbuffer.pos > 0U) {
            /* wait uintl RBNE is set */
            tick_start = hal_sys_basetick_count_get();
            while(RESET == _spi_flag_get(spi->periph, SPI_FLAG_RBNE)) {
                if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                    if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                        return HAL_ERR_TIMEOUT;
                    }
                }
            }
            (*(uint8_t *)p_rxbuffer++) = SPI_DATA(spi->periph);
            spi->rxbuffer.pos--;

        }
    } else { /* receive 16 bit data */
        while(spi->rxbuffer.pos > 0U) {
            /* wait uintl RBNE is set */
            tick_start = hal_sys_basetick_count_get();
            while(RESET == _spi_flag_get(spi->periph, SPI_FLAG_RBNE)) {
                if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                    if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                        return HAL_ERR_TIMEOUT;
                    }
                }
            }

            /* receive data */
            (*(uint16_t *)p_rxbuffer) = SPI_DATA(spi->periph);
            p_rxbuffer += sizeof(uint16_t);
            spi->rxbuffer.pos--;
        }
    }

    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)) {
        __HAL_SPI_CRC_NEXT(spi->periph);
        /* wait until RBNE is set */
        tick_start = hal_sys_basetick_count_get();
        while(RESET == _spi_flag_get(spi->periph, SPI_FLAG_RBNE)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        /* receive last data */
        if(SPI0 == spi->periph) {
            if(__HAL_SPI_GET_FRAME_SIZE(spi->periph) == SPI_FRAMESIZE_16BIT) {
                *((uint16_t *)p_rxbuffer) = SPI_DATA(spi->periph);
            } else {
                (*(uint8_t *)p_rxbuffer) = *(__IO uint8_t *)&SPI_DATA(spi->periph);
            }
        }

        /* wait until RBNE is set */
        tick_start = hal_sys_basetick_count_get();
        while(RESET == _spi_flag_get(spi->periph, SPI_FLAG_RBNE)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        tmp_crc = SPI_DATA(spi->periph);
        if(SET == _spi_flag_get(spi->periph, SPI_FLAG_CRCERR)) {
            _spi_clear_error_flag(spi->periph, SPI_ERROR_FLAG_CRCERR);
            spi->state = HAL_SPI_STATE_READY;
            return HAL_ERR_HARDWARE;
        }
    }
    /* check the end of the transaction */
    if(HAL_ERR_NONE != _spi_end_transmit_receive(spi, SPI_TIMEOUT_VALUE)) {
        spi->state = HAL_SPI_STATE_READY;
        return HAL_ERR_TIMEOUT;
    }

    spi->state = HAL_SPI_STATE_READY;

    /* unlock SPI */
    HAL_UNLOCK(spi);

    return HAL_ERR_NONE;

}

/*!
    \brief      transmit and receive amounts of data, poll receive process and completed status, the function is blocking
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_txbuffer: pointer to txbuffer
    \param[in]  p_rxbuffer: pointer to rxbuffer
    \param[in]  length: length of data to be sent
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_spi_transmit_receive_poll(hal_spi_dev_struct *spi, uint8_t *p_txbuffer, uint8_t *p_rxbuffer,
                                      uint32_t length, uint32_t timeout_ms)
{
    /* alternate Rx and Tx during transfer */
    uint32_t tx_flag = 1U;
    __IO uint16_t tmp_crc = 0U;
    uint32_t tick_start = 0;

