PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_spi.c
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == spi) || (NULL == p_rxbuffer) || (NULL == p_txbuffer) || (0 == length)) {
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(HAL_SPI_STATE_READY != spi->state) {
        return HAL_ERR_BUSY;
    }

    /* lock SPI */
    HAL_LOCK(spi);

    /* set transmit information */
    spi->state            = HAL_SPI_STATE_BUSY_TX_RX;
    spi->error_code       = HAL_ERR_NONE;
    spi->txbuffer.buffer  = (uint8_t *)p_txbuffer;
    spi->txbuffer.length  = length;
    spi->txbuffer.pos     = length;

    /* set receive information*/
    spi->rxbuffer.buffer  = (uint8_t *)p_rxbuffer;
    spi->rxbuffer.length  = length;
    spi->rxbuffer.pos     = length;

    spi->tx_callback      = NULL;
    spi->rx_callback      = NULL;

    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)) {
        /* reset CRC */
        __HAL_SPI_CRC_OFF(spi->periph);
        __HAL_SPI_CRC_ON(spi->periph);
    }

    __HAL_SPI_ENABLE(spi->periph);

    /* transmit and receive 16 bit data */
    if(__HAL_SPI_GET_FRAME_SIZE(spi->periph) == SPI_FRAMESIZE_16BIT) {
        if((SPI_SLAVE == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) ||
                (0x01U == spi->txbuffer.pos)) {
            SPI_DATA(spi->periph) = *((uint16_t *)p_txbuffer);
            p_txbuffer += sizeof(uint16_t);
            spi->txbuffer.pos--;
        }

        while(spi->txbuffer.pos > 0U || spi->rxbuffer.pos > 0U) {
            if(tx_flag && (spi->txbuffer.pos > 0U)) {
                tick_start = hal_sys_basetick_count_get();
                while(RESET == _spi_flag_get(spi->periph, SPI_FLAG_TBE)) {
                    if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                        if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                            return HAL_ERR_TIMEOUT;
                        }
                    }
                }

                SPI_DATA(spi->periph) = *((uint16_t *)p_txbuffer);
                p_txbuffer += sizeof(uint16_t);
                spi->txbuffer.pos--;
                tx_flag = 0U;

                /* enable CRC transmission */
                if((0U == spi->txbuffer.pos) &&
                        (SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph))) {
                    __HAL_SPI_CRC_NEXT(spi->periph);
                }
            }
            /* check RBNE flag */
            if((spi->rxbuffer.pos > 0U)) {
                tick_start = hal_sys_basetick_count_get();
                while(RESET == _spi_flag_get(spi->periph, SPI_FLAG_RBNE)) {
                    if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                        if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                            return HAL_ERR_TIMEOUT;
                        }
                    }
                }
                *((uint16_t *)p_rxbuffer) = SPI_DATA(spi->periph);
                p_rxbuffer += sizeof(uint16_t);
                spi->rxbuffer.pos--;
                /* next data is a transmission */
                tx_flag = 1U;
            }
        }
    } else { /* transmit and receive 8 bit data */
        if((SPI_SLAVE == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) ||
                (0x01U == spi->txbuffer.pos)) {
            SPI_DATA(spi->periph) = (*p_txbuffer);
            p_txbuffer += sizeof(uint8_t);
            spi->txbuffer.pos--;
        }
        while(spi->txbuffer.pos > 0U || spi->rxbuffer.pos > 0U) {
            if(tx_flag && (spi->txbuffer.pos > 0U)) {
                tick_start = hal_sys_basetick_count_get();
                /* wait until TBE is set */
                while(RESET == _spi_flag_get(spi->periph, SPI_FLAG_TBE)) {
                    if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                        if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                            return HAL_ERR_TIMEOUT;
                        }
                    }
                }

                *(__IO uint8_t *)&SPI_DATA(spi->periph) = (*p_txbuffer++);
                spi->txbuffer.pos--;
                tx_flag = 0U;

            }
            if((spi->txbuffer.pos == 0U) &&
                    (SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph))) {
                __HAL_SPI_CRC_NEXT(spi->periph);
            }
            if(spi->rxbuffer.pos > 0U) {
                tick_start = hal_sys_basetick_count_get();
                while(RESET == _spi_flag_get(spi->periph, SPI_FLAG_RBNE)) {
                    if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                        if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                            return HAL_ERR_TIMEOUT;
                        }
                    }
                }

                (*(uint8_t *)p_rxbuffer++) = SPI_DATA(spi->periph);
                spi->rxbuffer.pos--;
                tx_flag = 1U;
            }
        }
    }

    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)) {
        while(RESET == _spi_flag_get(spi->periph, SPI_FLAG_RBNE)) {
            tick_start = hal_sys_basetick_count_get();
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    spi->state = HAL_SPI_STATE_READY;
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
        tmp_crc = SPI_DATA(spi->periph);
        if(SET == _spi_flag_get(spi->periph, SPI_FLAG_CRCERR)) {
            _spi_clear_error_flag(spi->periph, SPI_ERROR_FLAG_CRCERR);
            spi->state = HAL_SPI_STATE_READY;
            return HAL_ERR_HARDWARE;
        }
    }

    /* check the end of the transaction */
    if(HAL_ERR_NONE != _spi_end_transmit_receive(spi, SPI_TIMEOUT_VALUE)) {
        spi->state = HAL_SPI_STATE_READY;
        return HAL_ERR_TIMEOUT ;
    }
    spi->state = HAL_SPI_STATE_READY;

    /* unlock SPI */
    HAL_UNLOCK(spi);

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by interrupt method, the function is non-blocking
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_txbuffer: pointer to txbuffer
    \param[in]  length: length of data to be sent
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_spi_transmit_interrupt(hal_spi_dev_struct *spi, uint8_t *p_txbuffer, uint32_t length,
                                   hal_spi_user_callback_struct *p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == spi) || (NULL == p_txbuffer) || (0 == length)) {
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

