PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_spi.c
    if(HAL_SPI_STATE_READY != spi->state) {
        return HAL_ERR_BUSY;
    }

    /* lock SPI */
    HAL_LOCK(spi);

    /* set the transmit information */
    spi->state = HAL_SPI_STATE_BUSY_TX;
    spi->error_code = HAL_SPI_ERROR_NONE;
    spi->txbuffer.buffer = (uint8_t *)p_txbuffer;
    spi->txbuffer.length = length;
    spi->txbuffer.pos = length;

    /* init field not used to zero */
    spi->rxbuffer.buffer  = (uint8_t *)NULL;
    spi->rxbuffer.length  = 0U;
    spi->rxbuffer.pos = 0U;

    spi->rx_callback = NULL;
    spi->tx_rx_callback = NULL;
    spi->tx_callback = (void *)p_user_func->complete_func;
    spi->error_callback = (void *)p_user_func->error_func;

    spi->spi_irq.transmit_handler = _spi_transmit_interrupt;

    if((SPI_CTL0(spi->periph)) & (SPI_CTL0_BDEN)) {
        SPI_CTL0(spi->periph) |= SPI_CTL0_BDOEN;
    }
    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)) {
        __HAL_SPI_CRC_OFF(spi->periph);
        __HAL_SPI_CRC_ON(spi->periph);
    }

    /* enable TBE and ERR interrupt */
    __HAL_SPI_INT_ENABLE(spi->periph, SPI_INT_TBE);
    __HAL_SPI_INT_ENABLE(spi->periph, SPI_INT_ERR);

    __HAL_SPI_ENABLE(spi->periph);

    /* unlock SPI */
    HAL_UNLOCK(spi);

    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by interrupt method, the function is non-blocking
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_rxbuffer: pointer to rxbuffer
    \param[in]  length: length of data to be sent
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_spi_receive_interrupt(hal_spi_dev_struct *spi, uint8_t *p_rxbuffer, uint32_t length,
                                  hal_spi_user_callback_struct *p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == spi) || (NULL == p_rxbuffer) || (0 == length)) {
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if((SPI_MASTER == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) &&
            (SPI_TRANSMODE_FULLDUPLEX == __HAL_SPI_GET_TRANS_MODE(spi->periph))) {
        spi->state = HAL_SPI_STATE_READY;
        /* call transmit-receive function to send dummy data generate clock */
        return hal_spi_transmit_receive_interrupt(spi, p_rxbuffer, p_rxbuffer, length,
                p_user_func);
    }

    if(HAL_SPI_STATE_READY != spi->state) {
        return HAL_ERR_BUSY;
    }

    /* lock SPI */
    HAL_LOCK(spi);

    spi->state = HAL_SPI_STATE_BUSY_RX;
    /* init field not used to zero */
    spi->txbuffer.buffer = (uint8_t *)NULL;
    spi->txbuffer.length = 0;
    spi->txbuffer.pos = 0;

    /* set the receiption information */
    spi->rxbuffer.buffer = (uint8_t *)p_rxbuffer;
    spi->rxbuffer.length = length;
    spi->rxbuffer.pos = length;

    spi->tx_callback = NULL;
    spi->rx_callback = (void *)p_user_func->complete_func;
    spi->error_callback = (void *)p_user_func->error_func;

    spi->spi_irq.receive_handler = _spi_receive_interrupt;

    if((SPI_CTL0(spi->periph)) & (SPI_CTL0_BDEN)) {
        SPI_CTL0(spi->periph) &= ~SPI_CTL0_BDOEN;
    }

    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)) {
        __HAL_SPI_CRC_OFF(spi->periph);
        __HAL_SPI_CRC_ON(spi->periph);
    }

    /* enable RBNE and ERR interrupt */
    __HAL_SPI_INT_ENABLE(spi->periph, SPI_INT_RBNE);
    __HAL_SPI_INT_ENABLE(spi->periph, SPI_INT_ERR);

    __HAL_SPI_ENABLE(spi->periph);

    /* unlock SPI */
    HAL_UNLOCK(spi);

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit and receive amounts of data by interrupt method, the function is non-blocking
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_txbuffer: pointer to txbuffer
    \param[in]  p_rxbuffer: pointer to rxbuffer
    \param[in]  length: length of data to be sent
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_spi_transmit_receive_interrupt(hal_spi_dev_struct *spi, uint8_t *p_txbuffer, uint8_t *p_rxbuffer,
        uint32_t length, hal_spi_user_callback_struct *p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == spi) || (NULL == p_rxbuffer) || (NULL == p_txbuffer) ||
            (0 == length)) {
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(spi->state != HAL_SPI_STATE_READY) {
        return HAL_ERR_BUSY;
    }

    /* lock SPI */
    HAL_LOCK(spi);

    __HAL_SPI_DISABLE(spi->periph);
    /* set transmit information */
    spi->state       = HAL_SPI_STATE_BUSY_TX_RX;
    spi->txbuffer.buffer  = (uint8_t *)p_txbuffer;
    spi->txbuffer.length  = length;
    spi->txbuffer.pos = length;

    /* set receiption information */
    spi->rxbuffer.buffer  = (uint8_t *)p_rxbuffer;
    spi->rxbuffer.length  = length;
    spi->rxbuffer.pos     = length;

    spi->tx_callback = NULL;
    spi->rx_callback = NULL;
    spi->tx_rx_callback = (void *)p_user_func->complete_func;
    spi->error_callback = (void *)p_user_func->error_func;

    spi->spi_irq.receive_handler = _spi_2lines_receive_interrupt;
    spi->spi_irq.transmit_handler = _spi_2lines_transmit_interrupt;

    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)) {
        __HAL_SPI_CRC_OFF(spi->periph);
        __HAL_SPI_CRC_ON(spi->periph);
    }

    /* enable TBE, RBNE and ERR interrupt */
    __HAL_SPI_INT_ENABLE(spi->periph, SPI_INT_TBE);
    __HAL_SPI_INT_ENABLE(spi->periph, SPI_INT_RBNE);
    __HAL_SPI_INT_ENABLE(spi->periph, SPI_INT_ERR);

