PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_spi.c
    __HAL_SPI_ENABLE(spi->periph);

    /* unlock SPI */
    HAL_UNLOCK(spi);

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by DMA method, the function is non-blocking
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_txbuffer: pointer to txbuffer
    \param[in]  length: length of data to be sent
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_BUSY, HAL_ERR_VAL details refer to gd32f3x0_hal.h
*/
int32_t hal_spi_transmit_dma(hal_spi_dev_struct *spi, uint8_t *p_txbuffer, uint16_t length,
                             hal_spi_user_callback_struct *p_user_func)
{
    hal_dma_irq_struct dma_irq;

#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == spi) || (NULL == p_txbuffer) || (0 == length)) {
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(spi->state != HAL_SPI_STATE_READY) {
        return HAL_ERR_BUSY;
    }

    /* lock SPI */
    HAL_LOCK(spi);

    /* set the transaction information */
    spi->state = HAL_SPI_STATE_BUSY_TX;
    spi->txbuffer.buffer = (uint8_t *)p_txbuffer;
    spi->txbuffer.length = length;
    spi->txbuffer.pos = length;

    /* Init field not used to zero */
    spi->rxbuffer.buffer = (uint8_t *)NULL;
    spi->rxbuffer.length = 0U;
    spi->rxbuffer.pos = 0U;
    spi->rx_callback = NULL;
    spi->tx_callback = (void *)p_user_func->complete_func;
    spi->error_callback = (void *)p_user_func->error_func;

    /* 1 lines transmit */
    if((SPI_CTL0(spi->periph)) & (SPI_CTL0_BDEN)) {
        SPI_CTL0(spi->periph) |= SPI_CTL0_BDOEN;
    }
    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)) {
        /* reset CRC */
        __HAL_SPI_CRC_OFF(spi->periph);
        __HAL_SPI_CRC_ON(spi->periph);
    }
    spi->p_dma_tx->dma_irq.half_finish_handle = NULL;
    spi->p_dma_tx->dma_irq.full_finish_handle = _spi_transmit_compelete_dma;
    spi->p_dma_tx->dma_irq.error_handle = _spi_dma_error;

    dma_irq.half_finish_handle = NULL;
    dma_irq.full_finish_handle = _spi_transmit_compelete_dma;
    dma_irq.error_handle = _spi_dma_error;

    hal_dma_start_interrupt(spi->p_dma_tx, (uint32_t)spi->txbuffer.buffer,
                            (uint32_t)&SPI_DATA(spi->periph), spi->txbuffer.pos, &dma_irq);
    __HAL_SPI_INT_ENABLE(spi->periph, SPI_INT_ERR);
    __HAL_SPI_ENABLE(spi->periph);

    /* enable SPI DMA transmit */
    __HAL_SPI_DMA_ENABLE(spi->periph, SPI_DMA_TRANSMIT);

    /* unlock SPI */
    HAL_UNLOCK(spi);

    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by DMA method, the function is non-blocking
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_rxbuffer: pointer to rxbuffer
    \param[in]  length: length of data to be sent
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_spi_receive_dma(hal_spi_dev_struct *spi, uint8_t *p_rxbuffer, uint16_t length,
                            hal_spi_user_callback_struct *p_user_func)
{
    hal_dma_irq_struct dma_irq;

#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == spi) || (NULL == p_rxbuffer) || (0 == length)) {
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if((SPI_MASTER == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) &&
            (SPI_TRANSMODE_FULLDUPLEX == __HAL_SPI_GET_TRANS_MODE(spi->periph))) {
        spi->state = HAL_SPI_STATE_READY;
        /* call transmit-receive function to send dummy data generate clock on CLK line */
        return hal_spi_transmit_receive_dma(spi, p_rxbuffer, p_rxbuffer, length,
                                            p_user_func);
    }

    if(spi->state != HAL_SPI_STATE_READY) {
        return HAL_ERR_BUSY;
    }

    /* lock SPI */
    HAL_LOCK(spi);

    spi->state = HAL_SPI_STATE_BUSY_RX;
    spi->error_code = HAL_ERR_NONE;
    spi->txbuffer.buffer  = (uint8_t *)NULL;
    spi->txbuffer.length  = 0;
    spi->txbuffer.pos = 0;

    /* set the receive information */
    spi->rxbuffer.buffer  = (uint8_t *)p_rxbuffer;
    spi->rxbuffer.length  = length;
    spi->rxbuffer.pos     = length;

    spi->rx_callback = (void *)p_user_func->complete_func;
    spi->error_callback = (void *)p_user_func->error_func;
    spi->tx_callback = NULL;

    /* 1 line receive */
    if((SPI_CTL0(spi->periph)) & (SPI_CTL0_BDEN)) {
        SPI_CTL0(spi->periph) &= ~SPI_CTL0_BDOEN;
    }
    /* DMA receive complete callback */
    spi->p_dma_rx->dma_irq.half_finish_handle = NULL;
    spi->p_dma_rx->dma_irq.full_finish_handle = _spi_receive_compelete_dma;
    spi->p_dma_rx->dma_irq.error_handle = _spi_dma_error;

    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)) {
        /* reset CRC */
        __HAL_SPI_CRC_OFF(spi->periph);
        __HAL_SPI_CRC_ON(spi->periph);
    }

    spi->tx_callback = NULL;
    spi->tx_rx_callback = NULL;
    spi->rx_callback = (void *)p_user_func->complete_func;
    spi->error_callback = (void *)p_user_func->error_func;

    /* DMA receive complete callback */
    dma_irq.half_finish_handle = NULL;
    dma_irq.full_finish_handle = _spi_receive_compelete_dma;
    dma_irq.error_handle = _spi_dma_error;

    hal_dma_start_interrupt(spi->p_dma_rx, (uint32_t)&SPI_DATA(spi->periph), (uint32_t)spi->rxbuffer.buffer,
                            spi->rxbuffer.pos, &dma_irq);

    __HAL_SPI_ENABLE(spi->periph);

    __HAL_SPI_INT_ENABLE(spi->periph, SPI_INT_ERR);

    /* enable SPI DMA receive */
    __HAL_SPI_DMA_ENABLE(spi->periph, SPI_DMA_RECEIVE);

    /* unlock SPI */
    HAL_UNLOCK(spi);

