PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_spi.c
    return HAL_ERR_NONE;
}

/*!
    \brief      transmit and receive amounts of data by DMA method, the function is non-blocking
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_txbuffer: pointer to txbuffer
    \param[in]  p_rxbuffer: pointer to rxbuffer
    \param[in]  length: length of data to be sent
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_spi_transmit_receive_dma(hal_spi_dev_struct *spi, uint8_t *p_txbuffer, uint8_t *p_rxbuffer, uint16_t length,
                                     hal_spi_user_callback_struct *p_user_func)
{
    hal_dma_irq_struct dma_irq;

#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == spi) || (NULL == p_rxbuffer) || (NULL == p_txbuffer) ||
            (0 == length)) {
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(HAL_SPI_STATE_READY != spi->state) {
        return HAL_ERR_BUSY;
    }

    /* lock SPI */
    HAL_LOCK(spi);

    /* set the transaction information */
    spi->state = HAL_SPI_STATE_BUSY_TX_RX;
    spi->txbuffer.buffer  = (uint8_t *)p_txbuffer;
    spi->txbuffer.length  = length;
    spi->txbuffer.pos = length;

    /* set the reception information */
    spi->rxbuffer.buffer = (uint8_t *)p_rxbuffer;
    spi->rxbuffer.length = length;
    spi->rxbuffer.pos = length;

    spi->tx_rx_callback = (void *)p_user_func->complete_func;
    spi->error_callback = (void *)p_user_func->error_func;

    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)) {
        /* reset CRC */
        __HAL_SPI_CRC_OFF(spi->periph);
        __HAL_SPI_CRC_ON(spi->periph);
    }

    spi->p_dma_tx->dma_irq.half_finish_handle = NULL;
    spi->p_dma_tx->dma_irq.full_finish_handle = NULL;
    spi->p_dma_tx->dma_irq.error_handle = NULL;

    spi->p_dma_rx->dma_irq.half_finish_handle = NULL;
    spi->p_dma_rx->dma_irq.full_finish_handle = _spi_transmit_receive_compelete_dma;
    spi->p_dma_rx->dma_irq.error_handle = _spi_dma_error;

    dma_irq.half_finish_handle = NULL;
    if(HAL_SPI_STATE_BUSY_RX == spi->state) {
        dma_irq.full_finish_handle = _spi_receive_compelete_dma;
    } else {
        dma_irq.full_finish_handle = _spi_transmit_receive_compelete_dma;
    }

    dma_irq.error_handle = _spi_dma_error;

    hal_dma_start_interrupt(spi->p_dma_rx, (uint32_t)&SPI_DATA(spi->periph), (uint32_t)spi->rxbuffer.buffer,
                            spi->rxbuffer.pos, &dma_irq);
    /* enable SPI DMA receive */
    __HAL_SPI_DMA_ENABLE(spi->periph, SPI_DMA_RECEIVE);

    hal_dma_start_interrupt(spi->p_dma_tx, (uint32_t)spi->txbuffer.buffer, (uint32_t)&SPI_DATA(spi->periph),
                            spi->txbuffer.pos, &dma_irq);

    __HAL_SPI_ENABLE(spi->periph);
    __HAL_SPI_INT_ENABLE(spi->periph, SPI_INT_ERR);
    /* enable SPI DMA transmit */
    __HAL_SPI_DMA_ENABLE(spi->periph, SPI_DMA_TRANSMIT);

    /* unlock SPI */
    HAL_UNLOCK(spi);

    return HAL_ERR_NONE;
}

/*!
    \brief      SPI interrupt handler content function, which is merely used in spi_handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_spi_irq(hal_spi_dev_struct *spi)
{
    __IO uint32_t tmp = 0x00U;

#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == spi) {
        HAL_DEBUGE("parameter [*spi] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if((_spi_interrupt_flag_get(spi->periph, SPI_INT_FLAG_TBE) != RESET)) {
        spi->spi_irq.transmit_handler(spi);
    }

    if(((SPI_STAT(spi->periph) & SPI_STAT_RXORERR) == RESET) &&
            (_spi_interrupt_flag_get(spi->periph, SPI_INT_FLAG_RBNE) != RESET)) {
        spi->spi_irq.receive_handler(spi);
    }

    if((((SPI_STAT(spi->periph) & (SPI_STAT_RXORERR | SPI_STAT_CONFERR | SPI_STAT_FERR))) != RESET) &&
            ((SPI_CTL1(spi->periph) & SPI_CTL1_ERRIE) != RESET)) {
        /* SPI overrun error interrupt occurred */
        if(_spi_interrupt_flag_get(spi->periph, SPI_INT_FLAG_RXORERR) != RESET) {
            _spi_clear_error_flag(spi->periph, SPI_ERROR_FLAG_RXORERR);
        }

        /* SPI mode error interrupt occurred */
        if(_spi_interrupt_flag_get(spi->periph, SPI_INT_FLAG_CONFERR) != RESET) {
            _spi_clear_error_flag(spi->periph, SPI_ERROR_FLAG_CONF);
        }

        /* SPI frame error interrupt occurred */
        if(_spi_interrupt_flag_get(spi->periph, SPI_INT_FLAG_FERR) != RESET) {
            _spi_clear_error_flag(spi->periph, SPI_ERROR_FLAG_FERR);
        }

        /* disable all interrupts */
        __HAL_SPI_INT_DISABLE(spi->periph, SPI_INT_TBE);
        __HAL_SPI_INT_DISABLE(spi->periph, SPI_INT_RBNE);
        __HAL_SPI_INT_DISABLE(spi->periph, SPI_INT_ERR);
        spi->state = HAL_SPI_STATE_READY;

        /* disable the SPI DMA requests if enabled */
        hal_dma_stop(spi->p_dma_tx);
        hal_dma_stop(spi->p_dma_rx);

    }
}

/*!
    \brief      set user-defined interrupt callback function
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to SPI interrupt callback function pointer structure
                  The structure member can be assigned as following parameters:
      \arg        hal_irq_handle_cb function pointer: the function is user-defined,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
      \arg        NULL: the corresponding callback mechanism is out of use, and
                     disable corresponding interrupt
    \param[out] none
    \retval     none
*/
void hal_spi_irq_handle_set(hal_spi_dev_struct *spi, hal_spi_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == spi) || (NULL == p_irq)) {
        HAL_DEBUGE("parameter [*spi] or [*p_irq] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(NULL != p_irq->error_handler) {
        spi->spi_irq.error_handler = p_irq->error_handler;
        __HAL_SPI_INT_ENABLE(spi->periph, SPI_INT_ERR);
    } else {
        spi->spi_irq.error_handler = NULL;
        __HAL_SPI_INT_DISABLE(spi->periph, SPI_INT_ERR);
    }

    if(NULL != p_irq->receive_handler) {
        spi->spi_irq.receive_handler = p_irq->receive_handler;
        __HAL_SPI_INT_ENABLE(spi->periph, SPI_INT_RBNE);
    } else {
        spi->spi_irq.receive_handler = NULL;
        __HAL_SPI_INT_DISABLE(spi->periph, SPI_INT_RBNE);
    }

    if(NULL != p_irq->transmit_handler) {
        spi->spi_irq.transmit_handler = p_irq->transmit_handler;
        __HAL_SPI_INT_ENABLE(spi->periph, SPI_INT_TBE);
    } else {
        spi->spi_irq.transmit_handler = NULL;
        __HAL_SPI_INT_DISABLE(spi->periph, SPI_INT_TBE);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_spi_irq_handle_all_reset(hal_spi_dev_struct *spi)
{
    spi->spi_irq.error_handler = NULL;
    spi->spi_irq.transmit_handler = NULL;
    spi->spi_irq.receive_handler = NULL;
    spi->spi_irq.transmit_receive_handler = NULL;
}

/*!
    \brief      start SPI module function
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/void hal_spi_start(hal_spi_dev_struct *spi)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == spi) {
        HAL_DEBUGE("parameter [*spi] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

