PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_spi.c
    __HAL_SPI_ENABLE(spi->periph);
}
/*!
    \brief      stop SPI module function
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/void hal_spi_stop(hal_spi_dev_struct *spi)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == spi) {
        HAL_DEBUGE("parameter [*spi] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    __HAL_SPI_DISABLE(spi->periph);
}

/*!
    \brief      SPI abort function
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_spi_abort(hal_spi_dev_struct *spi)
{
    uint32_t tick_start = 0;
    int32_t errorcode;
    errorcode = HAL_ERR_NONE;
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == spi)) {
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(SPI_CTL1(spi->periph) & SPI_CTL1_TBEIE) {
        spi->spi_irq.transmit_handler = _spi_stop_transmit_interrupt;
        tick_start = hal_sys_basetick_count_get();
        while(spi->state != HAL_SPI_ERROR_NONE) {
            if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)) {
                    spi->error_code = HAL_SPI_ERROR_ABORT;
                    break;
                }
            }
        }
    }

    if(SPI_CTL1(spi->periph) & SPI_CTL1_RBNEIE) {
        spi->spi_irq.receive_handler = _spi_stop_receive_interrupt;
        tick_start = hal_sys_basetick_count_get();
        while(spi->state != HAL_SPI_ERROR_NONE) {
            if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)) {
                    spi->error_code = HAL_SPI_ERROR_ABORT;
                    break;
                }
            }
        }
    }

    __HAL_SPI_INT_DISABLE(spi->periph, SPI_INT_ERR);
    if((SPI_CTL1(spi->periph)&SPI_CTL1_DMATEN) ||
            (SPI_CTL1(spi->periph)&SPI_CTL1_DMAREN)) {
        if(spi->p_dma_tx != NULL) {
            hal_dma_stop(spi->p_dma_tx);

            spi->error_code = HAL_SPI_ERROR_NONE;
            __HAL_SPI_DMA_DISABLE(spi->periph, SPI_DMA_TRANSMIT);
            if(HAL_ERR_NONE != _spi_end_transmit_receive(spi, SPI_TIMEOUT_VALUE)) {
                spi->error_code = HAL_SPI_ERROR_ABORT;
            }
            __HAL_SPI_DISABLE(spi->periph);
        }
        if(spi->p_dma_rx != NULL) {
            hal_dma_stop(spi->p_dma_rx);

            spi->error_code = HAL_SPI_ERROR_ABORT;
            __HAL_SPI_DISABLE(spi->periph);

            tick_start = hal_sys_basetick_count_get();
            while(RESET != _spi_flag_get(spi->periph, SPI_FLAG_TRANS)) {
                if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE) {
                    if(SET == hal_sys_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)) {
                        spi->error_code = HAL_SPI_ERROR_ABORT;
                    }
                }
            }
            __HAL_SPI_DMA_DISABLE(spi->periph, SPI_DMA_RECEIVE);
        }
    }
    spi->rxbuffer.pos = 0U;
    spi->txbuffer.pos = 0U;

    if(HAL_SPI_ERROR_ABORT == spi->error_code) {
        errorcode = HAL_ERR_NONE ;
    } else {
        spi->error_code = HAL_SPI_ERROR_NONE;
    }

    /* clear the rx overrun error flag */
    _spi_clear_error_flag(spi->periph, SPI_ERROR_FLAG_RXORERR);

    spi->state = HAL_SPI_STATE_READY;

    return errorcode;
}

/*!
    \brief      SPI DMA pause function
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_spi_dma_pause(hal_spi_dev_struct *spi)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == spi) {
        HAL_DEBUGE("parameter [*spi] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    __HAL_SPI_DMA_DISABLE(spi->periph, SPI_DMA_TRANSMIT);
    __HAL_SPI_DMA_DISABLE(spi->periph, SPI_DMA_RECEIVE);
}

/*!
    \brief      SPI DMA resume function
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_spi_dma_resume(hal_spi_dev_struct *spi)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == spi) {
        HAL_DEBUGE("parameter [*spi] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    __HAL_SPI_DMA_ENABLE(spi->periph, SPI_DMA_TRANSMIT);
    __HAL_SPI_DMA_ENABLE(spi->periph, SPI_DMA_RECEIVE);
}

/*!
    \brief      SPI DMA stop function
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_spi_dma_stop(hal_spi_dev_struct *spi)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == spi) {
        HAL_DEBUGE("parameter [*spi] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(NULL != spi->p_dma_rx) {
        hal_dma_stop(spi->p_dma_rx);
    }
    if(NULL != spi->p_dma_tx) {
        hal_dma_stop(spi->p_dma_tx);
    }

    __HAL_SPI_DMA_DISABLE(spi->periph, SPI_DMA_TRANSMIT);
    __HAL_SPI_DMA_DISABLE(spi->periph, SPI_DMA_RECEIVE);
    spi->state = HAL_SPI_STATE_READY;
}

/*!
    \brief      reset SPI
    \param[in]  spi_periph: SPIx(x=0,1)
    \param[out] none
    \retval     none
*/
static void _spi_deinit(uint32_t periph)
{
    switch(periph) {
    case SPI0:
        /* reset SPI0 */
        hal_rcu_periph_reset_enable(RCU_SPI0RST);
        hal_rcu_periph_reset_disable(RCU_SPI0RST);
        break;
    case SPI1:
        /* reset SPI1 */
        hal_rcu_periph_reset_enable(RCU_SPI1RST);
        hal_rcu_periph_reset_disable(RCU_SPI1RST);
        break;
    default :
        break;
    }
}

/*!
    \brief      SPI 8 bit transmit interrupt handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_transmit_interrupt(void *spi)
{
    hal_spi_dev_struct *p_spi = spi;
    if(__HAL_SPI_GET_FRAME_SIZE(p_spi->periph) == SPI_FRAMESIZE_16BIT) {
        SPI_DATA(p_spi->periph) = *((uint16_t *)p_spi->txbuffer.buffer);
        p_spi->txbuffer.buffer += sizeof(uint16_t);
        p_spi->txbuffer.pos--;
    } else {
        SPI_DATA(p_spi->periph) = *(p_spi->txbuffer.buffer);
        p_spi->txbuffer.buffer++;
        p_spi->txbuffer.pos--;
    }

    if(0U == p_spi->txbuffer.pos) {
        if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph)) {
            __HAL_SPI_CRC_NEXT(p_spi->periph);
        }
        _spi_close_transmit_interrupt(p_spi);
    }
}

/*!
    \brief      SPI receive interrupt handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_receive_interrupt(void *spi)
{
    hal_spi_dev_struct *p_spi = spi;

    if(__HAL_SPI_GET_FRAME_SIZE(p_spi->periph) == SPI_FRAMESIZE_16BIT) {
        *((uint16_t *)p_spi->rxbuffer.buffer) = SPI_DATA(p_spi->periph);
        p_spi->rxbuffer.buffer += sizeof(uint16_t);
        p_spi->rxbuffer.pos--;
    } else {
        *(p_spi->rxbuffer.buffer) = SPI_DATA(p_spi->periph);
        p_spi->rxbuffer.buffer++;
        p_spi->rxbuffer.pos--;

