PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_spi.c
    }
    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph) &&
            (1U == p_spi->rxbuffer.pos)) {
        __HAL_SPI_CRC_NEXT(p_spi->periph);
    }

    if(0U == p_spi->rxbuffer.pos) {
        if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph)) {
            __IO uint32_t tmp = 0U;
            tmp = SPI_DATA(p_spi->periph);
        }
        _spi_close_receive_interrupt(p_spi);
    }
}

/*!
    \brief      SPI 8 bit 2 lines receive interrupt handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_2lines_receive_interrupt(void *spi)
{
    hal_spi_dev_struct *p_spi = spi;

    if(__HAL_SPI_GET_FRAME_SIZE(p_spi->periph) == SPI_FRAMESIZE_16BIT) {

        *((uint16_t *)p_spi->rxbuffer.buffer) = (uint16_t)(SPI_DATA(p_spi->periph));
        p_spi->rxbuffer.buffer += sizeof(uint16_t);
        p_spi->rxbuffer.pos--;

    } else { /* receive data in 8 bit mode */
        *(p_spi->rxbuffer.buffer) = *((__IO uint8_t *)&SPI_DATA(p_spi->periph));
        p_spi->rxbuffer.buffer++;
        p_spi->rxbuffer.pos--;
    }

    if(0U == p_spi->rxbuffer.pos) {
        if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph)) {
            __IO uint32_t tmp = 0;
            tmp = SPI_DATA(p_spi->periph);
        }
        /* disable RBNE and ERR interrupt */
        __HAL_SPI_INT_DISABLE(p_spi->periph, SPI_INT_RBNE);
        __HAL_SPI_INT_DISABLE(p_spi->periph, SPI_INT_ERR);
        if(0U == p_spi->txbuffer.pos) {
            _spi_close_transmit_receive_interrupt(p_spi);
        }
    }

}

/*!
    \brief      SPI 8 bit 2 lines transmit interrupt handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_2lines_transmit_interrupt(void *spi)
{
    hal_spi_dev_struct *p_spi = spi;

    if(__HAL_SPI_GET_FRAME_SIZE(p_spi->periph) == SPI_FRAMESIZE_16BIT) {
        SPI_DATA(p_spi->periph) = *((uint16_t *)p_spi->txbuffer.buffer);
        p_spi->txbuffer.buffer += sizeof(uint16_t);
        p_spi->txbuffer.pos--;

    } else { /* transmit data in 8 bit mode */
        SPI_DATA(p_spi->periph) = *(p_spi->txbuffer.buffer);
        p_spi->txbuffer.buffer++;
        p_spi->txbuffer.pos--;
    }

    /* check end of the reception */
    if(0U == p_spi->txbuffer.pos) {
        if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph)) {
            __HAL_SPI_CRC_NEXT(p_spi->periph);
            __HAL_SPI_INT_DISABLE(p_spi->periph, SPI_INT_TBE);
            return;
        }
        /* disable RBNE and ERR interrupt */
        __HAL_SPI_INT_DISABLE(p_spi->periph, SPI_INT_TBE);

        if(0U == p_spi->rxbuffer.pos) {
            _spi_close_transmit_receive_interrupt(p_spi);
        }
    }
}

/*!
    \brief      SPI DMA transmit handler
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _spi_transmit_compelete_dma(void *dma)
{
    hal_spi_user_cb p_func = NULL;
    hal_spi_user_cb p_func_err = NULL;

    hal_dma_dev_struct *p_dma;
    hal_spi_dev_struct *p_spi;

    p_dma = (hal_dma_dev_struct *)dma;
    p_spi = (hal_spi_dev_struct *)p_dma->p_periph;
    p_func = (hal_spi_user_cb)p_spi->tx_callback;
    p_func_err = (hal_spi_user_cb)p_spi->error_callback;

    /* DMA normal Mode */
    if(SET != (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)) {
        /* disable ERR interrupt */
        __HAL_SPI_INT_DISABLE(p_spi->periph, SPI_INT_ERR);
        /* disable Tx DMA Request */
        __HAL_SPI_DMA_DISABLE(p_spi->periph, SPI_DMA_TRANSMIT);

        /* check the end of the transaction */
        if(HAL_ERR_NONE != _spi_end_transmit_receive(p_spi, SPI_TIMEOUT_VALUE)) {
            p_spi->error_code = HAL_SPI_ERROR_TIMEOUT;
        }

        /* clear overrun flag in 2 Lines communication mode because received data is not read */
        if(SPI_TRANSMODE_FULLDUPLEX == __HAL_SPI_GET_DEVICE_MODE(p_spi->periph)) {
            if(SET == _spi_flag_get(p_spi->periph, SPI_FLAG_RXORERR)) {
                _spi_clear_error_flag(p_spi->periph, SPI_ERROR_FLAG_RXORERR);
                p_spi->error_code = HAL_SPI_ERROR_CRC;
            }
        }

        p_spi->txbuffer.pos = 0U;
        p_spi->state = HAL_SPI_STATE_READY;

        if(p_spi->error_code != HAL_ERR_NONE) {
            if(NULL != p_func_err) {
                p_func_err(p_spi);
                return;
            }
        }
    }
    if(NULL != p_func) {
        p_func(p_spi);
    }

}

/*!
    \brief      SPI DMA receive handler
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _spi_receive_compelete_dma(void *dma)
{
    __IO uint16_t tmpcrc = 0U;
    hal_spi_user_cb p_func = NULL;
    hal_spi_user_cb p_func_err = NULL;

    hal_dma_dev_struct *p_dma;
    hal_spi_dev_struct *p_spi;

    p_dma = (hal_dma_dev_struct *)dma;
    p_spi = (hal_spi_dev_struct *)p_dma->p_periph;
    p_func = (hal_spi_user_cb)p_spi->rx_callback;
    p_func_err = (hal_spi_user_cb)p_spi->error_callback;

    /* DMA Normal Mode */
    if(SET != (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)) {
        /* Disable ERR interrupt */
        __HAL_SPI_INT_DISABLE(p_spi->periph, SPI_INT_ERR);
        /* disable Rx/Tx DMA Request */
        __HAL_SPI_DMA_DISABLE(p_spi->periph, SPI_DMA_TRANSMIT);
        __HAL_SPI_DMA_DISABLE(p_spi->periph, SPI_DMA_RECEIVE);
        if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph)) {
            tmpcrc = SPI_DATA(p_spi->periph);
        }

        /* check the end of the transaction */
        if(_spi_end_receive(p_spi, 200) != HAL_ERR_NONE) {
            p_spi->error_code = HAL_SPI_ERROR_TIMEOUT;
        }

