PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_spi.c
        p_spi->rxbuffer.pos = 0U;
        p_spi->state = HAL_SPI_STATE_READY;

        if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph)) {
            if(SET == _spi_flag_get(p_spi->periph, SPI_FLAG_CRCERR)) {
                _spi_clear_error_flag(p_spi->periph, SPI_ERROR_FLAG_CRCERR);
                p_spi->error_code = HAL_SPI_ERROR_CRC;
            }
        }

        if(p_spi->error_code != HAL_ERR_NONE) {
            if(NULL != p_func_err) {
                p_func_err(p_spi);
                return;
            }
        }
    }
    if(NULL != p_func) {
        p_func(p_spi);
    }
}

/*!
    \brief      SPI DMA transmit and receive handler
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _spi_transmit_receive_compelete_dma(void *dma)
{
    uint32_t tick_start = 0;
    __IO uint16_t tmpcrc = 0U;
    hal_spi_user_cb p_func = NULL;
    hal_spi_user_cb p_func_err = NULL;

    hal_dma_dev_struct *p_dma;
    hal_spi_dev_struct *p_spi;

    p_dma = (hal_dma_dev_struct *)dma;
    p_spi = (hal_spi_dev_struct *)p_dma->p_periph;
    p_func = (hal_spi_user_cb)p_spi->tx_rx_callback;
    p_func_err = (hal_spi_user_cb)p_spi->error_callback;

    /* DMA normal mode */
    if(SET != (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)) {
        /* disable ERR interrupt */
        __HAL_SPI_INT_DISABLE(p_spi->periph, SPI_INT_ERR);

        if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph)) {
            tick_start = hal_sys_basetick_count_get();
            while(RESET == _spi_flag_get(p_spi->periph, SPI_FLAG_RBNE)) {
                if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE) {
                    if(SET == hal_sys_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)) {
                        __HAL_SPI_CRC_OFF(p_spi->periph);
                        __HAL_SPI_CRC_ON(p_spi->periph);
                        break;
                    }
                }
            }
            tmpcrc = SPI_DATA(p_spi->periph);
        }

        /* check the end of the transaction */
        if(_spi_end_transmit_receive(p_spi, SPI_TIMEOUT_VALUE) != HAL_ERR_NONE) {
            p_spi->error_code = HAL_SPI_ERROR_TIMEOUT;
        }

        /* disable Rx and Tx DMA */
        __HAL_SPI_DMA_DISABLE(p_spi->periph, SPI_DMA_TRANSMIT);
        __HAL_SPI_DMA_DISABLE(p_spi->periph, SPI_DMA_RECEIVE);

        p_spi->rxbuffer.pos = 0U;
        p_spi->txbuffer.pos = 0U;
        p_spi->state = HAL_SPI_STATE_READY;

        if(p_spi->error_code != HAL_ERR_NONE) {
            if(NULL != p_func_err) {
                p_func_err(p_spi);
                return;
            }
        }
    }
    if(NULL != p_func) {
        p_func(p_spi);
    }

}

/*!
    \brief      SPI DMA error handler
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _spi_dma_error(void *dma)
{
    hal_spi_user_cb p_func_err = NULL;

    hal_dma_dev_struct *p_dma;
    hal_spi_dev_struct *p_spi;

    p_dma = (hal_dma_dev_struct *)dma;
    p_spi = (hal_spi_dev_struct *)p_dma->p_periph;
    p_func_err = (hal_spi_user_cb)p_spi->error_callback;

    __HAL_SPI_DMA_DISABLE(p_spi->periph, SPI_DMA_RECEIVE);
    __HAL_SPI_DMA_DISABLE(p_spi->periph, SPI_DMA_TRANSMIT);

    p_spi->error_code = HAL_SPI_ERROR_DMA;
    p_spi->state = HAL_SPI_STATE_READY;

    if(NULL != p_func_err) {
        p_func_err(p_spi);
    }
}

/*!
    \brief      SPI stop receive  interrupt handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_stop_receive_interrupt(void *spi)
{
    uint32_t tick_start = 0;
    hal_spi_dev_struct *p_spi = spi;
    /* disable SPI Peripheral */
    __HAL_SPI_DISABLE(p_spi->periph);

    /* disable TBEIE, RBNEIE and ERRIE interrupts */
    __HAL_SPI_INT_DISABLE(p_spi->periph, SPI_INT_TBE);
    __HAL_SPI_INT_DISABLE(p_spi->periph, SPI_INT_RBNE);
    __HAL_SPI_INT_DISABLE(p_spi->periph, SPI_INT_ERR);

    /* check RBNEIE is diabled */
    tick_start = hal_sys_basetick_count_get();
    while((SPI_CTL1(p_spi->periph) & SPI_CTL1_RBNEIE)) {
        if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE) {
            if(SET == hal_sys_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)) {
                p_spi->error_code = HAL_SPI_ERROR_ABORT;
            }
        }
    }

    tick_start = hal_sys_basetick_count_get();
    while(RESET != _spi_flag_get(p_spi->periph, SPI_FLAG_TRANS)) {
        if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE) {
            if(SET == hal_sys_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)) {
                p_spi->error_code = HAL_SPI_ERROR_ABORT;
            }
        }
    }

    p_spi->state = HAL_SPI_STATE_ABORT;
}

/*!
    \brief      SPI stop transmit interrupt handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_stop_transmit_interrupt(void *spi)
{
    hal_spi_dev_struct *p_spi = spi;

    /* disable TBEIE, ERRIE(mode fault event, overrun error, TI frame error) interrupts */
    __HAL_SPI_INT_DISABLE(p_spi->periph, SPI_INT_TBE);
    __HAL_SPI_INT_DISABLE(p_spi->periph, SPI_INT_ERR);

    /* disable SPI peripheral */
    __HAL_SPI_DISABLE(p_spi->periph);
}

/*!
    \brief      SPI close transmit and  receive interrupt handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_close_transmit_receive_interrupt(hal_spi_dev_struct *spi)
{
    hal_spi_user_cb p_func = NULL;

