PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_spi.c
    /* disable ERR interrupt */
    __HAL_SPI_INT_DISABLE(spi->periph, SPI_INT_ERR);
    /* check the end of the transaction */
    if(_spi_end_transmit_receive(spi, SPI_TIMEOUT_VALUE) != HAL_ERR_NONE) {
        spi->error_code = HAL_SPI_ERROR_TIMEOUT;
    }
    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)) {
        if(RESET != _spi_flag_get(spi->periph, SPI_FLAG_CRCERR)) {
            _spi_clear_error_flag(spi->periph, SPI_ERROR_FLAG_CRCERR);
            p_func = (hal_spi_user_cb)spi->error_callback;
            if(NULL != p_func) {
                p_func(spi);
            }
            return;
        }
    }
    if(HAL_ERR_NONE == spi->error_code) {
        if(HAL_SPI_STATE_BUSY_RX == spi->state) {
            spi->state = HAL_SPI_STATE_READY;
            p_func = (hal_spi_user_cb)spi->tx_callback;
            if(NULL != p_func) {
                p_func(spi);
            }
        } else {
            spi->state = HAL_SPI_STATE_READY;
            p_func = (hal_spi_user_cb)spi->tx_rx_callback;
            if(NULL != p_func) {
                p_func(spi);
            }
        }
    } else {
        spi->state = HAL_SPI_STATE_READY;
        p_func = (hal_spi_user_cb)spi->error_callback;
        if(NULL != p_func) {
            p_func(spi);
        }
    }

}

/*!
    \brief      SPI close receive interrupt handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_close_receive_interrupt(hal_spi_dev_struct *spi)
{
    hal_spi_user_cb p_func = NULL;

    /* disable ERR interrupt */
    __HAL_SPI_INT_DISABLE(spi->periph, SPI_INT_ERR);
    __HAL_SPI_INT_DISABLE(spi->periph, SPI_INT_RBNE);

    if(HAL_ERR_NONE != _spi_end_receive(spi, SPI_TIMEOUT_VALUE)) {
        spi->error_code = HAL_SPI_ERROR_TIMEOUT;
    }

    spi->state = HAL_SPI_STATE_READY;

    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)) {
        if(RESET != _spi_flag_get(spi->periph, SPI_FLAG_CRCERR)) {
            _spi_clear_error_flag(spi->periph, SPI_ERROR_FLAG_CRCERR);
            p_func = (hal_spi_user_cb)spi->error_callback;
            if(NULL != p_func) {
                p_func(spi);
            }
            return;
        }
    }
    if(HAL_SPI_ERROR_NONE == spi->error_code) {
        p_func = (hal_spi_user_cb)spi->rx_callback;
        if(NULL != p_func) {
            p_func(spi);
        }
    } else {
        p_func = (hal_spi_user_cb)spi->error_callback;
        if(NULL != p_func) {
            p_func(spi);
        }
    }
}

/*!
    \brief      SPI close transmit interrupt handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_close_transmit_interrupt(hal_spi_dev_struct *spi)
{
    hal_spi_user_cb p_func = NULL;

    /* disable TBE and ERR interrupt */
    __HAL_SPI_INT_DISABLE(spi->periph, SPI_INT_ERR);
    __HAL_SPI_INT_DISABLE(spi->periph, SPI_INT_TBE);

    /* check the end of the transaction */
    if(_spi_end_transmit_receive(spi, SPI_TIMEOUT_VALUE) != HAL_ERR_NONE) {
        p_func = (hal_spi_user_cb)spi->error_callback;
        if(NULL != p_func) {
            p_func(spi);
        }
    } else {
        p_func = (hal_spi_user_cb)spi->tx_callback;
        spi->state = HAL_SPI_STATE_READY;
        if(NULL != p_func) {
            p_func(spi);
        }
    }

}

/*!
    \brief      check SPI receive end
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
static int32_t _spi_end_receive(hal_spi_dev_struct *spi,  uint32_t timeout_ms)
{
    uint32_t tick_start = 0;
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == spi) {
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if((SPI_MASTER == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) &&
            (SPI_TRANSMODE_FULLDUPLEX != __HAL_SPI_GET_DEVICE_MODE(spi->periph))) {
        /* disable SPI peripheral */
        __HAL_SPI_DISABLE(spi->periph);
    }

    tick_start = hal_sys_basetick_count_get();
    while(RESET != _spi_flag_get(spi->periph, SPI_FLAG_TRANS)) {
        if(HAL_TIMEOUT_FOREVER != timeout_ms) {
            if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                return HAL_ERR_TIMEOUT;
            }
        }
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      check SPI transmit and receive end
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
static int32_t _spi_end_transmit_receive(hal_spi_dev_struct *spi,
        uint32_t timeout_ms)
{
    uint32_t tick_start = 0;
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == spi) {
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check if the SPI trans bit is SET */
    tick_start = hal_sys_basetick_count_get();
    while(RESET != _spi_flag_get(spi->periph, SPI_FLAG_TRANS)) {
        if(HAL_TIMEOUT_FOREVER != timeout_ms) {
            if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                return HAL_ERR_TIMEOUT;
            }
        }
    }

    __HAL_SPI_INT_DISABLE(spi->periph, SPI_INT_TBE);
    __HAL_SPI_INT_DISABLE(spi->periph, SPI_INT_RBNE);
    __HAL_SPI_INT_DISABLE(spi->periph, SPI_INT_ERR);
    __HAL_SPI_DISABLE(spi->periph);

