PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_spi.c
    return HAL_ERR_NONE;
}

/*!
    \brief      check SPI transmit and receive end
    \param[in]  periph: SPIx(x=0,1)
    \param[in]  error_flag: error flag
                only one parameter can be selected which is shown as below:
      \arg        SPI_ERROR_FLAG_CONF: SPI configuration error
      \arg        SPI_ERROR_FLAG_FERR: SPI format error
      \arg        SPI_ERROR_FLAG_CRCERR: SPI CRC error
      \arg        SPI_ERROR_FLAG_RXORERR: SPI reception overrun error
    \param[out] none
    \retval     none
*/
static void _spi_clear_error_flag(uint32_t periph, uint32_t error_flag)
{
    __IO uint32_t temp = 0;
    switch(error_flag) {
    case SPI_ERROR_FLAG_CONF:
        temp = SPI_STAT(periph);
        SPI_CTL0(periph) &= (uint32_t)(~SPI_CTL0_SPIEN);
        break;
    case SPI_ERROR_FLAG_RXORERR:
        temp = SPI_DATA(periph);
        temp = SPI_STAT(periph);
        break;
    case SPI_ERROR_FLAG_FERR:
        temp = SPI_STAT(periph);
        break;
    case SPI_ERROR_FLAG_CRCERR:
        SPI_STAT(periph) &= (uint32_t)(~SPI_FLAG_CRCERR);
        break;
    default:
        break;
    }
}

/*!
    \brief      get SPI flag status
    \param[in]  spi_periph: SPIx(x=0,1)
    \param[in]  flag: SPI flag status
                only one parameter can be selected which are shown as below:
      \arg        SPI_FLAG_TBE: transmit buffer empty flag
      \arg        SPI_FLAG_RBNE: receive buffer not empty flag
      \arg        SPI_FLAG_TRANS: transmit on-going flag
      \arg        SPI_FLAG_RXORERR: receive overrun error flag
      \arg        SPI_FLAG_CONFERR: mode config error flag
      \arg        SPI_FLAG_CRCERR: CRC error flag
      \arg        SPI_FLAG_FERR: SPI format error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
static FlagStatus _spi_flag_get(uint32_t periph, uint32_t flag)
{
    if(RESET != (SPI_STAT(periph) & flag)) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      get SPI interrupt flag status
    \param[in]  spi_periph: SPIx(x=0,1)
    \param[in]  interrupt: SPI interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        SPI_INT_FLAG_TBE: transmit buffer empty interrupt flag
      \arg        SPI_INT_FLAG_RBNE: receive buffer not empty interrupt flag
      \arg        SPI_INT_FLAG_RXORERR: overrun interrupt flag
      \arg        SPI_INT_FLAG_CONFERR: config error interrupt flag
      \arg        SPI_INT_FLAG_CRCERR: CRC error interrupt flag
      \arg        SPI_INT_FLAG_FERR: format error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
static FlagStatus _spi_interrupt_flag_get(uint32_t periph, uint8_t interrupt)
{
    uint32_t reg1 = SPI_STAT(periph);
    uint32_t reg2 = SPI_CTL1(periph);

    switch(interrupt) {
    /* SPI transmit buffer empty interrupt */
    case SPI_INT_FLAG_TBE:
        reg1 = reg1 & SPI_STAT_TBE;
        reg2 = reg2 & SPI_CTL1_TBEIE;
        break;
    /* SPI receive buffer not empty interrupt */
    case SPI_INT_FLAG_RBNE:
        reg1 = reg1 & SPI_STAT_RBNE;
        reg2 = reg2 & SPI_CTL1_RBNEIE;
        break;
    /* SPI overrun interrupt */
    case SPI_INT_FLAG_RXORERR:
        reg1 = reg1 & SPI_STAT_RXORERR;
        reg2 = reg2 & SPI_CTL1_ERRIE;
        break;
    /* SPI config error interrupt */
    case SPI_INT_FLAG_CONFERR:
        reg1 = reg1 & SPI_STAT_CONFERR;
        reg2 = reg2 & SPI_CTL1_ERRIE;
        break;
    /* SPI CRC error interrupt */
    case SPI_INT_FLAG_CRCERR:
        reg1 = reg1 & SPI_STAT_CRCERR;
        reg2 = reg2 & SPI_CTL1_ERRIE;
        break;
    /* SPI format error interrupt */
    case SPI_INT_FLAG_FERR:
        reg1 = reg1 & SPI_STAT_FERR;
        reg2 = reg2 & SPI_CTL1_ERRIE;
        break;
    default :
        break;
    }
    /*get SPI interrupt flag status */
    if((0U != reg1) && (0U != reg2)) {
        return SET;
    } else {
        return RESET;
    }
}
